import { book } from 'assets/images';
import { FullBookDTO } from 'types/types';

export const mockBooks: FullBookDTO[] = [
  {
    id: 0,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    imageLink: book,
    author: 'Адитья Бхаргава, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: undefined,
    isBooked: false,
  },
  {
    id: 1,
    category: 'history',
    title: 'Программирование на JAVA',
    imageLink: book,
    author: 'Адитья Бхаргава, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: false,
  },
  {
    id: 2,
    category: 'history',
    title: 'Грокаем алгоритмы.',
    imageLink: book,
    author: 'Адитья Бхаргава, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: true,
    bookedTill: '2023-05-03T19:15:43.079Z',
  },
  {
    id: 3,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    imageLink: book,
    author: 'Адитья Бхаргава, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: false,
  },
  {
    id: 4,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    imageLink: book,
    author: 'Адитья Бхаргава, Патрик Нимейер, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: true,
  },
  {
    id: 5,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное ',
    imageLink: undefined,
    author: 'Адитья Бхаргава, , Патрик Нимейер, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: undefined,
    isBooked: true,
    bookedTill: '2023-04-23T19:15:43.079Z',
  },
  {
    id: 6,
    category: 'history',
    title: 'Грокаем алгоритмы.',
    imageLink: book,
    author: 'Адитья Бхаргава, Патрик Нимейер, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: false,
  },
  {
    id: 7,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    imageLink: book,
    author: 'Адитья Бхаргава, Патрик Нимейер, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: false,
  },
  {
    id: 8,
    category: 'history',
    title: 'Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих',
    imageLink: book,
    author: 'Адитья Бхаргава, 2019',
    about:
      'Алгоритмы — это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы — это просто. А грокать алгоритмы — это веселое и увлекательное занятие.',
    rating: 4,
    isBooked: true,
    bookedTill: '2023-03-08T19:15:43.079Z',
  },
];
